### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # aws_s3_bucket.main will be destroyed
  # (because aws_s3_bucket.main is not in configuration)
-   resource "aws_s3_bucket" "main" {
-       acl                         = "authenticated-read" -> null
-       arn                         = "arn:aws:s3:::my-codely-test-bucket" -> null
-       bucket                      = "my-codely-test-bucket" -> null
-       bucket_domain_name          = "my-codely-test-bucket.s3.amazonaws.com" -> null
-       bucket_regional_domain_name = "my-codely-test-bucket.s3.eu-west-1.amazonaws.com" -> null
-       force_destroy               = false -> null
-       hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
-       id                          = "my-codely-test-bucket" -> null
-       object_lock_enabled         = false -> null
-       region                      = "eu-west-1" -> null
-       request_payer               = "BucketOwner" -> null
-       tags                        = {
-           "accountable" = "development"
-           "domain"      = "codely"
-           "stage"       = "dev"
-           "terraform"   = "false"
        } -> null
-       tags_all                    = {
-           "accountable" = "development"
-           "domain"      = "codely"
-           "stage"       = "dev"
-           "terraform"   = "false"
        } -> null

-       grant {
-           permissions = [
-               "READ",
            ] -> null
-           type        = "Group" -> null
-           uri         = "http://acs.amazonaws.com/groups/global/AuthenticatedUsers" -> null
        }
-       grant {
-           id          = "847b728c34bf26302a7e16d3a1f43ff73c27720ad20ac9de0bb62028ea7fa7f5" -> null
-           permissions = [
-               "FULL_CONTROL",
            ] -> null
-           type        = "CanonicalUser" -> null
        }

-       server_side_encryption_configuration {
-           rule {
-               bucket_key_enabled = false -> null

-               apply_server_side_encryption_by_default {
-                   sse_algorithm = "AES256" -> null
                }
            }
        }

-       versioning {
-           enabled    = false -> null
-           mfa_delete = false -> null
        }
    }

  # aws_sqs_queue.terraform_queue will be created
+   resource "aws_sqs_queue" "terraform_queue" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 90
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 2048
+       message_retention_seconds         = 86400
+       name                              = "terraform-example-queue"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 10
+       tags                              = {
+           "Environment" = "production"
        }
+       tags_all                          = {
+           "Environment" = "production"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>